## In this Notebook we test simple SQL transactions
***
Site where was created the database

In [1]:
#https://www.tutorialspoint.com/sqlalchemy/sqlalchemy_core_creating_table.htm


# https://db4free.net/phpMyAdmin/index.php
# Banco de dados: ebrains
# Nome de usuário: matheus_ebrains
# Senha :ebrainsteste

In [31]:
import pymysql
pymysql.install_as_MySQLdb()
import pandas as pd
import sqlalchemy as sql
from sqlalchemy import create_engine, MetaData, Table, Column, Integer, String, Text, Float

Connecting with the database

In [32]:
connect_string = 'mysql://matheus_ebrains:ebrainsteste@85.10.205.173/ebrains'
sql_engine = sql.create_engine(connect_string)

Here we decided to import a csv data in order to create a DataFrame

In [4]:
# Loading the data
train = pd.read_csv('train_titanic.csv')

# Showing overview of the train dataset
train.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Below, some unnecessary columns are removed from the Dataframe

In [11]:
df = train.drop(columns=['Ticket', 'Cabin','Survived','SibSp','Parch'])

In [12]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,Fare,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,S
4,5,3,"Allen, Mr. William Henry",male,35.0,8.0500,S

In this part we are going to create a new table in our dabase
- It is imported some variable from the "sqlalchemy" which are necessary to define the data type of each column.
- The data type of each column is defined acording the coresponding fild in the DataFrame.

In [21]:
from sqlalchemy import Table, Column, Integer, String, MetaData
meta = MetaData()

students = Table(
   'passageiros', meta, 
   Column('PassengerId', Integer, primary_key = True), 
   Column('Pclass', Integer), 
   Column('Name', Text),
   Column('Sex', String(255)),
   Column('Age', Float), 
   Column('Fare', Float),
   Column('Embarked', String(255)),
)
meta.create_all(sql_engine)

Below, we do a SQL requisition to be sure if we have created the new table.''

In [33]:
sql = """
SELECT * FROM INFORMATION_SCHEMA.TABLES WHERE TABLE_TYPE='BASE TABLE'
"""
tabelas = pd.read_sql_query(sql, sql_engine)
tabelas.head()

,TABLE_CATALOG,TABLE_SCHEMA,TABLE_NAME,TABLE_TYPE,ENGINE,VERSION,ROW_FORMAT,TABLE_ROWS,AVG_ROW_LENGTH,DATA_LENGTH,...,INDEX_LENGTH,DATA_FREE,AUTO_INCREMENT,CREATE_TIME,UPDATE_TIME,CHECK_TIME,TABLE_COLLATION,CHECKSUM,CREATE_OPTIONS,TABLE_COMMENT
0,def,ebrains,membros_ebrains,BASE TABLE,InnoDB,10,Dynamic,4,4096,16384,...,0,0,None,2019-10-21 03:16:10,None,None,utf8mb4_0900_ai_ci,None,,
1,def,ebrains,passageiros,BASE TABLE,InnoDB,10,Dynamic,0,0,16384,...,0,0,None,2019-10-25 12:59:34,None,None,utf8mb4_0900_ai_ci,None,,

We chose insert only the first fifty rows from the Dataframe on the our new SQL table, then we copy them into another DataFrame.

In [24]:
data =df[:50].copy()

In [35]:
data.to_sql('passageiros', con = sql_engine, if_exists = 'append', chunksize = 1000, index=False)

Here we do a SQL Query to see if it is all right.

In [36]:
sql = """
SELECT Name, Sex 
FROM passageiros;
"""
consulta = pd.read_sql_query(sql, sql_engine)
consulta.head()

                                                Name     Sex
0                            Braund, Mr. Owen Harris    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                             Heikkinen, Miss. Laina  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                           Allen, Mr. William Henry    male